#include"General.h"

/*****************************************************************************
 函 数 名  :
 功能描述  :
 输入参数  : 无
 输出参数  : 无
 返 回 值  : void
 调用函数  :
			函数名					所在文件					功能
* 1
 修改历史      :
  1.日    期   : x
	作    者   : x
	修改内容   : x

*****************************************************************************/
void Admin_Login_View() {
	system("cls");
	printf("******************************************************************************************\n");
	printf("                                   管  理  员  登  录\n");
	printf("******************************************************************************************\n");
}

void Admin_Main_Menu_View() {
	system("cls");
	printf("******************************************************************************************\n");
	printf("                              管   理   员   主   菜   单\n");
	printf("******************************************************************************************\n");
	printf("1.查看所有用户  2.删除用户  3.查看所有商品  4.搜索商品  5.下架商品  6.查看所有订单  7.注销\n");
	printf("******************************************************************************************\n");
}

void Admin_View_All_Users_View() {
	system("cls");
	printf("******************************************************************************************\n");
	printf("                               所     有     用     户\n");
	printf("******************************************************************************************\n");
	printf("ID          名称          密码           联系方式            地址               余额      \n");
	printf("******************************************************************************************\n");
}

void Admin_Delete_User_View() {
	system("cls");
	printf("******************************************************************************************\n");
	printf("                                   用    户    删    除    \n");
	printf("******************************************************************************************\n");
}

void Admin_Delete_User_Sure_View(User* p) {
	printf("******************************************************************************************\n");
	printf("                             删    除    用    户    确    认    \n");
	printf("******************************************************************************************\n");
	printf("ID:	        %-7s\n", p->ID);
	printf("用户名：	%-21s\n", p->name);
	printf("密码：		%-11s\n", p->passwd);
	printf("联系方式:	%-21s\n", p->contact);
	printf("地址:		%-41s\n", p->address);
	printf("余额：		%-7.1lf\n", p->money);
	printf("*****************************是否根据以上信息删除该用户？(Y/N)****************************\n");
}

void Admin_View_All_Merchandises_View() {
	system("cls");
	printf("******************************************************************************************\n");
	printf("                               所     有     商     品\n");
	printf("******************************************************************************************\n");
	printf("ID        名称                  价格         卖家ID       上架时间         状态    \n");
	printf("******************************************************************************************\n");
}

void Admin_Search_Merchandise_View() {
	system("cls");
	printf("******************************************************************************************\n");
	printf("                               搜    索     商     品\n");
	printf("******************************************************************************************\n");
}

void Admin_Found_Merchandise_View(Merchandise* p) {
	system("pause");
	printf("******************************************************************************************\n");
	printf("                                     查找到如下商品\n");
	printf("******************************************************************************************\n");
	printf("ID:	        %s\n", p->ID);
	printf("名称：		%s\n", p->name);
	printf("价格：		%.1lf\n", p->price);
	printf("描述：		%s\n", p->discribe);
	printf("卖家ID:		%s\n", p->bussiness_id);
	printf("上架时间：	%d-%d-%d\n", p->launch_time.year, p->launch_time.month, p->launch_time.day);
	cout << "商品状态：	" << p->state_table[p->state] << endl;
	printf("******************************************************************************************\n");
}

void Admin_Off_Merchandise_View() {
	system("cls");
	printf("******************************************************************************************\n");
	printf("                               下    架     商     品\n");
	printf("******************************************************************************************\n");
}

void Admin_Off_Merchandise_Sure_View(Merchandise* p) {
	printf("***********************************************************************************\n");
	printf("                                查找到商品如下\n");
	printf("***********************************************************************************\n");
	printf("ID:	        %s\n", p->ID);
	printf("名称：		%s\n", p->name);
	printf("价格：		%.1lf\n", p->price);
	printf("描述：		%s\n", p->discribe);
	printf("卖家ID:		%s\n", p->bussiness_id);
	printf("上架时间：	%d-%d-%d\n", p->launch_time.year, p->launch_time.month, p->launch_time.day);
	cout << "商品状态：	" << p->state_table[p->state] << endl;
	printf("*****************************是否根据以上信息下架商品？(Y/N)**********************\n");
}

void Admin_View_All_Orders_View() {
	string state_table[2]{ "存在", "已删除" };
	system("cls");
	printf("***********************************************************************************\n");
	printf("                       订       单       列       表\n");
	printf("***********************************************************************************\n");
	printf("ID       商品ID       交易金额       交易时间       卖家ID       买家ID      状态  \n");
	printf("***********************************************************************************\n");
	Order* cursor = orders_head;
	while (cursor != NULL) {
		printf("%-18s %-10s %-10.1lf %d-%d-%d %-10s %-9s ", cursor->ID, cursor->mer_id, cursor->tamount, cursor->time.year, cursor->time.month, cursor->time.day, cursor->seller_id, cursor->buyer_id);
		cout << state_table[cursor->exist] << endl;
		cursor = cursor->next;
	}
	printf("***********************************************************************************\n");
}