#include"General.h"

/*****************************************************************************
 函 数 名  :
 功能描述  :
 输入参数  : 无
 输出参数  : 无
 返 回 值  : void
 调用函数  :
			函数名					所在文件					功能
* 1
 修改历史      :
  1.日    期   : x
	作    者   : x
	修改内容   : x

*****************************************************************************/
void User_Register_Menu_View() {
	system("cls");
	printf("***********************************************************************************\n");
	printf("                               用   户   注   册\n");
	printf("***********************************************************************************\n");
}

void User_Register_Sure_View(User* p) {
	printf("***********************************************************************************\n");
	printf("                              请核对以下信息是否有误\n");
	printf("***********************************************************************************\n");
	printf("ID:	        %-7s\n", p->ID);
	printf("用户名：	%-21s\n", p->name);
	printf("密码：		%-11s\n", p->passwd);
	printf("联系方式:	%-21s\n", p->contact);
	printf("地址:		%-41s\n", p->address);
	printf("余额：		%-7.1lf\n", p->money);
	printf("*****************************是否根据以上信息注册新用户？(Y/N)*********************\n");
}


/*****************************************************************************
 函 数 名  :
 功能描述  :
 输入参数  : 无
 输出参数  : 无
 返 回 值  : void
 调用函数  :
			函数名					所在文件					功能
* 1
 修改历史      :
  1.日    期   : x
	作    者   : x
	修改内容   : x

*****************************************************************************/
void User_Login_Menu_View() {
	system("cls");
	printf("***********************************************************************************\n");
	printf("                               用   户   登   录\n");
	printf("***********************************************************************************\n");
}



/*****************************************************************************
 函 数 名  :
 功能描述  :
 输入参数  : 无
 输出参数  : 无
 返 回 值  : void
 调用函数  :
			函数名					所在文件					功能
* 1
 修改历史      :
  1.日    期   : x
	作    者   : x
	修改内容   : x

*****************************************************************************/
void User_Main_Menu_View() {
	system("cls");
	printf("***********************************************************************************\n");
	printf("                              用   户   主   菜   单\n");
	printf("***********************************************************************************\n");
	printf("       1.我是卖家       2.我是买家         3.个人信息管理            4.注销登录    \n");
	printf("***********************************************************************************\n");
}



/*****************************************************************************
 函 数 名  :
 功能描述  :
 输入参数  : 无
 输出参数  : 无
 返 回 值  : void
 调用函数  :
			函数名					所在文件					功能
* 1
 修改历史      :
  1.日    期   : x
	作    者   : x
	修改内容   : x

*****************************************************************************/
void User_Seller_Menu_View() {
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                                    卖   家   主   菜   单\n");
	printf("***********************************************************************************************\n");
	printf("1.发布商品   2.查看已发布商品   3.修改商品信息   4.下架商品   5.查看历史订单   6.返回用户主界面\n");
	printf("***********************************************************************************************\n");
}

void User_Seller_Release_Product_View() {
	system("cls");
	printf("***********************************************************************************\n");
	printf("                               上   架   商   品\n");
	printf("***********************************************************************************\n");
}

void User_Seller_Release_Product_Sure_View(Merchandise* p) {
	printf("***********************************************************************************\n");
	printf("                              请核对以下信息是否有误\n");
	printf("***********************************************************************************\n");
	printf("ID:	        %s\n", p->ID);
	printf("名称：		%s\n", p->name);
	printf("价格：		%.1lf\n", p->price);
	printf("描述：		%s\n", p->discribe);
	printf("卖家ID:		%s\n", p->bussiness_id);
	printf("上架时间：	%d-%d-%d\n", p->launch_time.year, p->launch_time.month, p->launch_time.day);
	cout << "商品状态：	" << p->state_table[p->state] << endl;
	printf("*****************************是否根据以上信息上架商品？(Y/N)**********************\n");
}

void User_Seller_My_Products_View() {
	printf("***********************************************************************************\n");
	printf("                                      我的商品\n");
	printf("***********************************************************************************\n");
	printf("ID        名称                  价格         卖家ID       上架时间         状态    \n");
	printf("***********************************************************************************\n");
	Merchandise* cursor = merchandises_head;
	while (cursor != NULL) {
		if (strcmp(cursor->bussiness_id, Current_User->ID) == 0 && cursor->state != 2) {
			printf("%-9s %-21s %-12.1lf %-12s %-4d-%-2d-%-2d", cursor->ID, cursor->name, cursor->price, cursor->bussiness_id, cursor->launch_time.year, cursor->launch_time.month, cursor->launch_time.day);
			cout << "       " << cursor->state_table[cursor->state] << endl;
		}
		cursor = cursor->next;
	}
	printf("***********************************************************************************\n");
}

void User_Seller_Modify_Product_View() {
	system("cls");
	printf("***********************************************************************************\n");
	printf("                               修   该   商   品\n");
	printf("***********************************************************************************\n");
}

void User_Seller_Modify_Product_Tails(Merchandise* p) {
	system("cls");
	printf("***********************************************************************************\n");
	printf("                             是否需要修改以下商品的信息？\n");
	printf("***********************************************************************************\n");
	printf("ID：			%s\n", p->ID);
	printf("1.名称：		%s\n", p->name);
	printf("2.价格：		%.1lf\n", p->price);
	printf("3.描述：		%s\n", p->discribe);
	printf("上架时间：		%d-%d-%d\n", p->launch_time.year, p->launch_time.month, p->launch_time.day);
	cout << "4.状态：		" << p->state_table[p->state] << endl;
	printf("*****************************是否根据以上信息修改商品？(Y/N)**********************\n");
}

void User_Seller_Off_Product_View() {
	system("cls");
	printf("***********************************************************************************\n");
	printf("                               下   架   商   品\n");
	printf("***********************************************************************************\n");
}

void User_Seller_Off_Product_Sure_View(Merchandise* p) {
	printf("***********************************************************************************\n");
	printf("                                查找到商品如下\n");
	printf("***********************************************************************************\n");
	printf("ID:	        %s\n", p->ID);
	printf("名称：		%s\n", p->name);
	printf("价格：		%.1lf\n", p->price);
	printf("描述：		%s\n", p->discribe);
	printf("卖家ID:		%s\n", p->bussiness_id);
	printf("上架时间：	%d-%d-%d\n", p->launch_time.year, p->launch_time.month, p->launch_time.day);
	cout << "商品状态：	" << p->state_table[p->state] << endl;
	printf("*****************************是否根据以上信息下架商品？(Y/N)**********************\n");
}

void User_Seller_View_All_Orders_View() {
	string state_table[2]{ "存在", "已删除" };
	printf("***********************************************************************************\n");
	printf("                       订       单       列       表\n");
	printf("***********************************************************************************\n");
	printf("ID       商品ID       交易金额       交易时间       卖家ID       买家ID            \n");
	printf("***********************************************************************************\n");
	Order* cursor = orders_head;
	while (cursor != NULL) {
		if (cursor->exist == 1) {
			printf("%-18s %-10s %-10.1lf %d-%d-%d %-10s %-9s\n", cursor->ID, cursor->mer_id, cursor->tamount, cursor->time.year, cursor->time.month, cursor->time.day, cursor->seller_id, cursor->buyer_id);
		}
		cursor = cursor->next;
	}
	printf("***********************************************************************************\n");
}

/*****************************************************************************
 函 数 名  :
 功能描述  :
 输入参数  : 无
 输出参数  : 无
 返 回 值  : void
 调用函数  :
			函数名					所在文件					功能
* 1
 修改历史      :
  1.日    期   : x
	作    者   : x
	修改内容   : x

*****************************************************************************/
void User_Buyer_Search_Merchandise_View() {
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                                    搜    索     商     品\n");
	printf("***********************************************************************************************\n");
}

void User_Buyer_Found_View(Merchandise* p) {
	system("pause");
	printf("******************************************************************************************\n");
	printf("                                     查找到如下商品\n");
	printf("******************************************************************************************\n");
	printf("ID:	        %s\n", p->ID);
	printf("名称：		%s\n", p->name);
	printf("价格：		%.1lf\n", p->price);
	printf("描述：		%s\n", p->discribe);
	printf("卖家ID:		%s\n", p->bussiness_id);
	printf("上架时间：	%d-%d-%d\n", p->launch_time.year, p->launch_time.month, p->launch_time.day);
	cout << "商品状态：	" << p->state_table[p->state] << endl;
	printf("******************************************************************************************\n");
}

void User_Buyer_View_More_Details_View(){
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                         查    看    商    品    详    细    信    息\n");
	printf("***********************************************************************************************\n");
}

void User_Buyer_View_Details_View(Merchandise* p){
	system("pause");
	printf("******************************************************************************************\n");
	printf("                                     查找到如下商品\n");
	printf("******************************************************************************************\n");
	printf("ID:	        %s\n", p->ID);
	printf("名称：		%s\n", p->name);
	printf("价格：		%.1lf\n", p->price);
	printf("描述：		%s\n", p->discribe);
	printf("卖家ID:		%s\n", p->bussiness_id);
	printf("上架时间：	%d-%d-%d\n", p->launch_time.year, p->launch_time.month, p->launch_time.day);
	cout << "商品状态：	" << p->state_table[p->state] << endl;
	printf("******************************************************************************************\n");
}

void User_Buyer_Buy_Merchandise_View(){
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                                    购    买     商     品\n");
	printf("***********************************************************************************************\n");
}

void User_Buyer_Buy_Merchandise_Sure_View(Merchandise* p){
	printf("***********************************************************************************\n");
	printf("                                查找到商品如下\n");
	printf("***********************************************************************************\n");
	printf("ID:	        %s\n", p->ID);
	printf("名称：		%s\n", p->name);
	printf("价格：		%.1lf\n", p->price);
	printf("描述：		%s\n", p->discribe);
	printf("卖家ID:		%s\n", p->bussiness_id);
	printf("上架时间：	%d-%d-%d\n", p->launch_time.year, p->launch_time.month, p->launch_time.day);
	cout << "商品状态：	" << p->state_table[p->state] << endl;
	printf("*****************************是否购买以上信息描述的商品？(Y/N)**********************\n");
}

void User_Buyer_Menu_View() {
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                                    买   家   主   菜   单\n");
	printf("***********************************************************************************************\n");
	printf("1.搜索商品   2.查看商品列表   3.查看商品详细信息   4.购买商品  5.查看历史订单  6.返回用户主界面\n");
	printf("***********************************************************************************************\n");
}

void User_Buyer_View_All_Orders_View() {
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                      我      的      历      史      订      单      \n");
	printf("***********************************************************************************************\n");
	printf("ID       商品ID       交易金额       交易时间       卖家ID\n");
	printf("***********************************************************************************************\n");
	Order* cursor = orders_head;
	while (cursor != NULL) {
		if (strcmp(Current_User->ID, cursor->buyer_id) == 0) {
			printf("%-8s %-10s %-10.1lf %d-%d-%d %-10s\n", cursor->ID, cursor->mer_id, cursor->tamount, cursor->time.year, cursor->time.month, cursor->time.day, cursor->seller_id);
		}
		cursor = cursor->next;
	}
	printf("***********************************************************************************************\n");
}

/*****************************************************************************
 函 数 名  :
 功能描述  :
 输入参数  : 无
 输出参数  : 无
 返 回 值  : void
 调用函数  :
			函数名					所在文件					功能
* 1
 修改历史      :
  1.日    期   : x
	作    者   : x
	修改内容   : x

*****************************************************************************/

void User_Recharge_View() {
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                                    用     户     充     值     \n");
	printf("***********************************************************************************************\n");
}

void User_Information_View(User* p) {
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                                    用     户     信     息     \n");
	printf("***********************************************************************************************\n");
	printf("ID:	        %-7s\n", p->ID);
	printf("用户名：	%-21s\n", p->name);
	printf("密码：		%-11s\n", p->passwd);
	printf("联系方式:	%-21s\n", p->contact);
	printf("地址:		%-41s\n", p->address);
	printf("余额：		%-7.1lf\n", p->money);
	printf("***********************************************************************************************\n");
}

void User_PIM_Menu_View() {
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                                    信     息     管     理     \n");
	printf("***********************************************************************************************\n");
	printf("1.查看信息                 2.修改信息                   3.充值                 4.返回用户主界面\n");
	printf("***********************************************************************************************\n");
}

void User_Information_Modify_View(User* p) {
	system("cls");
	printf("***********************************************************************************************\n");
	printf("                                    信     息     修    改     \n");
	printf("***********************************************************************************************\n");
	printf("ID:	        %-7s\n", p->ID);
	printf("1.用户名：	%-21s\n", p->name);
	printf("2.密码：	%-11s\n", p->passwd);
	printf("3.联系方式:	%-21s\n", p->contact);
	printf("4.地址:		%-41s\n", p->address);
	printf("余额：		%-7.1lf\n", p->money);
	printf("***********************************************************************************************\n");
}